---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ViewId
source: html/afec98fb-dba1-2413-baa4-6889550d8087.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ViewId Property

The element id of the view to export. InvalidElementId by default. Used only when ExportScope = View.

## Syntax (C#)
```csharp
public ElementId ViewId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null